import os
import glob
import copy
import pandas as pd
from datetime import datetime as dt
import shutil
import sys

def aireceipt_receipt_pp(dir_path, outdir_path, type):
    print('type = {}'.format(type))
    """
    指定されたディレクトリパスに存在する全てのUKEファイルを開き、
    日付のフォーマット修正、カルテ番号のクレンジングを行います。
    行単位で実施します。
    """
    # 2020年に追加された救急医療管理加算1の算定コードを変更します。
    if type == "iseikai":
        # ウ細分化なし
        comment_list = [
            [["820100001", "820100393", "820100394"], "820100016"],  # ア
            [["820100395", "820100396", "820100397", "820100398", "820100399",
              "820100400", "820100401", "820100402", "820100403"], "820100017"],  # イ
            [["820100404", "820100405", "820100406", "820100407"], "820100018-1"],  # ウ（心不全）
            [["820100408", "820100409", "820100410"], "820100018-2"],  # ウ(呼吸不全)
            [["820100411"], "820100019"],  # エ
            [["820100412", "820100413", "820100414", "820100415"], "820100020"],  # オ
            [["842100001", "842100002", "842100003", "842100004", "842100005",
              "842100006", "830100023"], "820100021"],  # カ
            [["820100416", "820100417", "820100418", "820100419", "820100420"], "820100022"],  # キ
            [["820100421"], "820100023"],  # ク
            # 2022年改訂追加(2022/4/15)
            [["830100024","820100808"], "820100024"]  # ケ
        ]
    else:
        comment_list=[
            [["820100001","820100393","820100394"],"820100016"], # ア
            [["820100395","820100396","820100397","820100398","820100399",
              "820100400","820100401","820100402","820100403"],"820100017"], # イ
            [["820100404","820100405","820100406","820100407"],"820100018-1"], # ウ（心不全）
            [["820100408","820100409","820100410"],"820100018-2"], # ウ(呼吸不全)
            [["820100411"],"820100019"], # エ
            [["820100412","820100413","820100414","820100415"],"820100020"], # オ
            [["842100001","842100002","842100003","842100004","842100005",
              "842100006","830100023"],"820100021"], # カ
            [["820100416","820100417","820100418","820100419","820100420"],"820100022"], # キ
            [["820100421"],"820100023"], # ク
            # 2022年改訂追加(2022/4/15)
            [["830100024","820100808"],"820100024"] # ケ
        ]

    # コードまとめ
    merge_list=[
        [["113017610","113017710","113017810","113017910"],"113017610-113017710"], # 入院栄養食事指導料
        [["113001310","113002110"],"113001310-113002110"], # 悪性腫瘍特異物質治療管理料
        # 2022年改訂追加(2022/4/15)
        [["111014210", "111014310", "111014410"], "111000110"],  # 初診料：3コードを111000110に置換
        [["150000790"], "150371590"],  # 時間外特例医療機関加算２（手術）→1のコードに置換
        [["150000690"], "150371490"],  # 深夜加算２（手術）→1のコードに置換
        [["150000590"], "150371290"],  # 休日加算２（手術）→1のコードに置換
        [['150000490', '150371390'], '150371590'], # 時間外加算 →時間外特例医療機関加算に置換
        [['140009310'], '140063810'],  # 人工呼吸 → 人工呼吸（５時間超１５日目以降）
        [['140062210', '140062310'], '140062110'],  # 下肢創傷処置（足趾の深い潰瘍・踵部の浅い潰瘍） 下肢創傷処置（足部（踵を除く）の深い潰瘍・踵部の深い潰瘍） → 下肢創傷処置（足部（踵を除く）の浅い潰瘍）
        [["111014210", "111014310", "111012510", "111012710"], "111000110"], # 初診料：3コードを111000110に置換
        [["113000510","113000670"],"113000410"], # 特定薬剤治療管理料１
        [["114004110"],"114003710"], # 在宅酸素療法指導管理料（その他）
        [["140000810", "140000910", "140001010"], "140000710"],  # 創傷処置（１００ｃｍ２以上５００ｃｍ２未満）
        [["140063810", "140064750", "114005510", "114006810", "140039550", "140039650"], "140023510"],  # 人工呼吸（５時間超）
        [["140048710", "140048810", "140048910", "140049010"], "140048610"],  # 重度褥瘡処置
        [["150339110", "150380170"], "150339010"],  # 画像等手術支援加算(ナビゲーション）
        [["150383710", "150383810", "150392050", "150392150", "150031710", "150353110"], "150295010"],  # 骨移植術（自家骨）
        [["150148110"], "150148010"],  # 大動脈バルーンパンピング法（ＩＡＢＰ法）（初日）
        [["150395550"], "150395450"],  # 経皮的循環補助法（ポンプカテーテルを使用）（初日）
        [["150328010"], "150327910"],  # 輸血管理料１
        [["150342510","150342610"],"150342710"],#麻酔管理料２
        [["150422770"],"150391070"],#神経ブロック併施加算（イ以外）
        [["150438170"],"150438070"],#周術期薬剤管理加算
        [["170002310"],"160064610"],#心カテ（右心）
        [["180053910"],"180024710"],#リハビリテーション総合計画評価料
        [["190218110", "190193310"], "190193110"],  # 認知症ケア加算２、３（１４日以内）→1のコードに置換
        [["190218210", "190193410"], "190193210"],  # 認知症ケア加算２、３（１５日以上）→1のコードに置換
        [["190218310", "190193710"], "190193510"],  # 認知症ケア加算２、３（１４日以内）身体的拘束実施→1のコードに置換
        [["190218410", "190193810"], "190193610"],  # 認知症ケア加算２、３（１５日以上）身体的拘束実施→1のコードに置換
        [["190173210"],"190120610"],#褥瘡ハイリスク患者ケア加算
        [["190147110"],"190136810"],#栄養サポートチーム加算
        [["190832510", "190832710", "190832810"], "190832610"],  # 特定感染症入院医療管理加算
        [["190146510"],"190106570"],#無菌治療室管理加算
        [["190191510", "190833510", "190833610"], "190191410"],  # がん診療連携拠点病院加算
        [["190192510", "190192710"], "190192310"],  # 入退院支援加算１（一般病棟入院基本料等）
        [["193588970"],"193521870"],#早期栄養介入管理加算（特定集中治療室管理料）
        [["193014970"],"190219270"],#早期栄養介入管理加算（経腸栄養）（特定集中治療室管理料）
        [["190245810","193013410"],"193587410"], # 早期離床・リハビリテーション加算（救命救急入院料）
        [["193013510"],"190245910"],#早期栄養介入管理加算（救命救急入院料）
        [["193013610"],"190246010"],# 早期栄養介入管理加算（経腸栄養）（救命救急入院料）
        [["197001570"],"197000470"] # 特別食加算（生活療養）→ 特別食加算（食事療養）
    ]


    try:
        # 医誠会
        if type == "iseikai":
            # 日付変換：対象の情報区分と要素の番号
            target_date_list = [["BU", [2, 3]], ["CD", [1]], ["RE", [6, 8]]]
            # 救急医療管理加算1の対象区分
            target_co_list = ["CO", 3]
            # merge_listの対象区分
            target_si_list = [["SI", 3],["CD", 5]]
            # [桁数,対象の列番号]
            target_karute_list = [8, 13]

        # # 蒲郡
        # elif type == "gama":
        #     print(type)
        #     target_date_list = [["BU", [2, 3]], ["CD", [1]], ["RE", [6, 8]]]
        #     # カルテ番号のフォーマットに変更ない場合
        #     target_karute_list = ["nan", "nan"]

        # 小牧
        elif type == "komaki":
            target_date_list = [["BU", [2, 3]], ["CD", [1]], ["RE", [6, 8]]]
            # 救急医療管理加算1の対象区分
            target_co_list = ["CO", 3]
            # merge_listの対象区分
            target_si_list = [["SI", 3],["CD", 5]]
            # カルテ番号のフォーマットに変更ない場合
            target_karute_list = ["nan", "nan"]
            
        # プレ診断設定
        elif type == "preset":
            target_date_list = [["BU", [2, 3]], ["CD", [1]], ["RE", [6, 8]]]
            # 救急医療管理加算1の対象区分
            target_co_list = ["CO", 3]
            # merge_listの対象区分
            target_si_list = [["SI", 3],["CD", 5]]
            # 前２桁削除
            target_karute_list = [2, 13]
            
        else:
            # 異常系終了
            raise Exception(type)

        # 指定されたディレクトリが存在するかチェック
        if not os.path.isdir(dir_path):
            raise Exception(dir_path + " is not directory")

        # 拡張子UKEのファイルを取得
        file_list = [os.path.abspath(p) for p in glob.glob(os.path.abspath(dir_path) + "/**/*.UKE", recursive=True) if os.path.isfile(p)]

        # 和暦とコードの対応表df作成
        master_df = pd.DataFrame({
            'コード': ["1","2","3","4","5"],
            '年': ["1867","1911","1925","1988","2018"],
            '内容': ["明治","大正","昭和","平成","令和"]
        })

        # target_date_list　情報区分のみ抽出
        kubun_list = []
        for taregt, num_list in target_date_list:
            kubun_list.append(taregt)

        # ファイルの数分ループ
        for file_path in file_list:
            if os.path.isfile(file_path):

                # 出力パス取得
                outdir = os.path.basename(os.path.dirname(file_path))
                outfile = os.path.basename(file_path)
                outpath = outdir_path + "/" + outdir + "/" + outfile

                # outpathが存在する場合削除
                if os.path.isfile(outpath):
                    os.remove(outpath)

                # 出力フォルダ作成
                os.makedirs(outdir_path + "/" + outdir + "/", exist_ok=True)

                with open(file_path, mode='r') as f, open(outpath, mode='w') as ff:

                    # オープンしたファイルを行ごとに読み込んで、カンマ区切りでリストに変換
                    for idx, text in enumerate(f.readlines()):
                        text_list = text.split(',')

                        # kubun_listと一致する要素があるか確認
                        if text_list[0] in kubun_list:

                            # REの場合　カルテ番号クレンジング　実施
                            if text_list[0] == "RE":

                                # "nan"の場合何もしない、"nan"以外の場合if内の処理
                                if target_karute_list[0] != "nan":
                                    text_list[target_karute_list[1]] = text_list[target_karute_list[1]][0:target_karute_list[0]]

                            # 一致した要素のindex番号を取得
                            for num in target_date_list[kubun_list.index(text_list[0])][1]:
                                # 日付変換　西暦
                                if len(text_list[num]) == 8:
                                    seireki_gappi = text_list[num]
                                    # 日付変換チェック
                                    try:
                                        tdatetime = dt.strptime(seireki_gappi, '%Y%m%d')
                                        tstr = tdatetime.strftime('%Y/%m/%d')
                                    except:
                                        tstr = ''
                                    text_list[num] = tstr

                                # 日付変換　和暦
                                elif len(text_list[num]) == 7:
                                    gappi = text_list[num]

                                    # コードに対応する年を取得
                                    target_year = master_df["年"][master_df["コード"] == gappi[0]].values[0]
                                    year = int(target_year) + int(gappi[1:3])
                                    seireki_gappi = str(year) + gappi[3:5] + gappi[5:7]

                                    # 日付変換チェック
                                    tdatetime = dt.strptime(seireki_gappi, '%Y%m%d')
                                    tstr = tdatetime.strftime('%Y/%m/%d')
                                    text_list[num] = tstr

                                elif len(text_list[num]) == 0:
                                    text_list[num] = "nan"

                                else:
                                    print(text_list[num])
                                    raise Exception

                        # 救急医療管理加算：コメントコード置換
                        if text_list[0] == target_co_list[0]:
                            text_list2 = copy.copy(text_list)

                            # コード検索
                            for comment_code,comment_replace in comment_list:
                                if text_list2[target_co_list[1]] in comment_code:
                                    text_list2[target_co_list[1]] = comment_replace

                                    # list→文字列
                                    text2 = ','.join(text_list2)
                                    # 複製
                                    ff.write(text2)

                        # 診療行為コード、CD：置換
                        for _index in range(len(target_si_list)):
                            if text_list[0] == target_si_list[_index][0]:
                                for merge_code, merge_replace in merge_list:
                                    if text_list[target_si_list[_index][1]] in merge_code:
                                        text_list[target_si_list[_index][1]] = merge_replace

                        # list→文字列
                        text = ','.join(text_list)

                        # 既存ファイルの末尾に追加
                        # with open(outpath, mode='a') as ff:
                        ff.write(text)

    except Exception as e:
        # 異常系終了
        print(e)
        exit(1)

    # 正常系終了
    exit(0)

# 単体テスト用コマンド呼び出し関数
if __name__ == "__main__":
    """
    引数
        input_path : レセプトフォルダー
        output_path: 加工済レセプトフォルダー（レセプト診断AI APIの入力用フォルダー）
        type       : "preset"
                     初期設定はプレ診断の設定です。以下のいずれかを設定してください。
                     "iseikai" , "komaki" , "preset"
    復帰値(result)
        0: 正常終了
        1: 異常終了
    """

    args = sys.argv
    input_path = args[1]
    output_path = args[2]
    type = "iseikai"


    result = aireceipt_receipt_pp(input_path, output_path, type)